Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретАвтообзвона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеконтактныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПринятиеВРаботуОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПринятиеВРаботуОрганизации</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ЗагрузкаДанныхДолжника</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Document.ЗагрузкаДанных</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/АктПередачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктПередачи</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПередающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПередающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПринимающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринимающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПередающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылГлавнымГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПринимающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначитьГлавнымГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНазначатьСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменялРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯПонимаюЧтоЯДелаю</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ДолговыеОбязательства/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьДОПоДолжнику(ДолжникСсылка) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 2
	                      |	ДолговыеОбязательства.Ссылка
	                      |ИЗ
	                      |	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
	                      |ГДЕ
	                      |	ДолговыеОбязательства.Владелец = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", ДолжникСсылка);	
	Таблица = Запрос.Выполнить().Выгрузить();
	Если Таблица.Количество() = 1 Тогда
		Возврат Таблица[0].Ссылка;
	Иначе
		Возврат Справочники.ДолговыеОбязательства.ПустаяСсылка();
	КонецЕсли;	
КонецФункции

Функция НайтиЭлемент(КодЭлемента) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДолговыеОбязательства.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДолговыеОбязательства КАК ДолговыеОбязательства
		|ГДЕ
		|	ДолговыеОбязательства.КодДО = &КодДО";
	
	Запрос.УстановитьПараметр("КодДО", СокрЛП(КодЭлемента));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
	КонецЕсли;
	
	Возврат ПустаяСсылка();

КонецФункции // ()

Функция ПолучитьОтобранныеДолговыеОбязательства(КомпоновщикДС) Экспорт

	СКД = Справочники.ДолговыеОбязательства.ПолучитьМакет("ПодборДолговыхОбязательств");

	Отборы = СКД.ВариантыНастроек.Основной.Настройки.Отбор;
	Настройки = КомпоновщикДС.ПолучитьНастройки().Отбор;
	Для каждого Настройка Из Настройки.Элементы Цикл
	
		Если НЕ ОтборКорректен(Настройка) Тогда
		
			Возврат Новый Массив;
		
		КонецЕсли;
	
	КонецЦикла;
	
	КомпоновкаДанныхКлиентСервер.СкопироватьЭлементы(Отборы, Настройки, Ложь);
	
	ЭлементыОтбора = Отборы.Элементы;
	ОбработатьДополнительныеРеквизиты(СКД, ЭлементыОтбора);

	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Источник = Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД);
	КомпоновщикНастроек.Инициализировать(Источник);
	
	ТипГенератора = Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений");
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, СКД.ВариантыНастроек.Основной.Настройки, , , ТипГенератора);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ДолговыеОбязательства = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ДолговыеОбязательства);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ДолговыеОбязательства.ВыгрузитьКолонку("Объект");

КонецФункции // ()

Функция ОрганизацияУчетаДляБизнесПроцесса(ДанныеУчета) Экспорт

	СтатусУчета = РегистрыНакопления.ОбъектыВРаботе.СтатусУчета(ДанныеУчета);
	
	Если СтатусУчета = "НаПодразделении" Тогда
	
		Ответ = Новый Структура;
		Ответ.Вставить("Результат", Истина);
		Ответ.Вставить("ТекстОшибки", "");
		Возврат Ответ;
	
	КонецЕсли;
	
	Если СтатусУчета = "НаОрганизации" Тогда
	
		Результат = ПринятьВРаботуПодразделенияИзБП(ДанныеУчета);
		
		Ответ = Новый Структура;
		Ответ.Вставить("Результат", Результат);
		Ответ.Вставить("ТекстОшибки", "Не удалось принять в работу подразделения");
		Возврат Ответ;
	
	КонецЕсли;
	
	Если СтатусУчета = "НеВРаботе" Тогда
	
		НачатьТранзакцию();
		Попытка
		
			Результат = ПринятьВРаботуОрганизацииИзБП(ДанныеУчета);
			Если Не Результат Тогда
			
				ВызватьИсключение "Не удалось принять в работу организации";
			
			КонецЕсли;
			
			Результат = ПринятьВРаботуПодразделенияИзБП(ДанныеУчета);
			Если Не Результат Тогда
			
				ВызватьИсключение "Не удалось принять в работу подразделения";
			
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		
		Исключение
			ОтменитьТранзакцию();
			Ответ = Новый Структура;
			Ответ.Вставить("Результат", Ложь);
			Ответ.Вставить("ТекстОшибки", "Не удалось принять в работу: " + КраткоеПредставлениеОшибки(ОписаниеОшибки()));
			Возврат Ответ;
		КонецПопытки;

	КонецЕсли;
	
	Ответ = Новый Структура;
	Ответ.Вставить("Результат", Истина);
	Ответ.Вставить("ТекстОшибки", "");
	Возврат Ответ;

КонецФункции // ()

Функция ПолучитьОтветственных(Элемент, ТипСотрудника) Экспорт

	Запрос = РегистрыСведений.ОтветственныеСотрудники.ЗапросДляОпределенияОтветственного();
	Запрос.УстановитьПараметр("Объект", Элемент);
	Запрос.УстановитьПараметр("ТипСотрудника", ТипСотрудника);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ()

Функция КонвертироватьЗависимости(ДолговыеОбязательства) Экспорт

	Возврат ДолговыеОбязательства;

КонецФункции // ()

Функция ВладелецМесенджера(Элемент) Экспорт

	Возврат Элемент.Должник;

КонецФункции // ()

Функция ПолучитьЭлементПоИдентификатору(Идентификатор) Экспорт

	Возврат Справочники.Контрагенты
		.ПолучитьЭлементПоИдентификатору(Идентификатор);

	КонецФункции // ()
	
#КонецОбласти

#Область ПринятиеВРаботу

Функция ПринятьВРаботуОрганизацииИзБП(ДанныеУчета)

	ДанныеПринятия = Новый Структура;
	ДанныеПринятия.Вставить("Организация", ДанныеУчета["Организация"]);
	ДанныеПринятия.Вставить("Автор", ДанныеУчета["БизнесПроцесс"]);
	ДанныеПринятия.Вставить("Комментарий", ДанныеУчета["Комментарий"]);
	
	ОбъектПринятия = ДанныеУчета["Объект"];
	Объекты = Новый Массив;
	Объекты.Добавить(ОбъектПринятия);
	
	Приниматель = Документы.ПринятиеВРаботуОрганизации;
	Документ = ПринятьВРаботуОрганизации(Приниматель, ДанныеПринятия, Объекты);
	
	// Первоначальная реализация ТекущаяДатаСеанса() - 1
	// Ставим документ ПринятияВРаботу(Дата - 2) перед АктомПередачи(Дата - 1)
	Документ.Дата = Документ.Дата - 2;
	
	Попытка
	
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции // ()

Функция ПринятьВРаботуПодразделенияИзБП(ДанныеУчета)

	Если ДанныеУчета["Подразделение"].Пустая() Тогда
	
		Возврат Истина;
	
	КонецЕсли;
	
	ДанныеПринятия = Новый Структура;
	ДанныеПринятия.Вставить("Организация", ДанныеУчета["Организация"]);
	ДанныеПринятия.Вставить("Автор", ДанныеУчета["БизнесПроцесс"]);
	ДанныеПринятия.Вставить("Комментарий", ДанныеУчета["Комментарий"]);
	ДанныеПринятия.Вставить("ПодразделениеПринимающее", ДанныеУчета["Подразделение"]);
	ДанныеПринятия.Вставить("НеНазначатьСотрудников", Истина);
	
	ОбъектПринятия = ДанныеУчета["Объект"];
	Объекты = Новый Массив;
	Объекты.Добавить(ОбъектПринятия);
	
	Приниматель = Документы.АктПередачи;
	Документ = ПринятьВРаботуОрганизации(Приниматель, ДанныеПринятия, Объекты);
	
	// Первоначальная реализация ТекущаяДатаСеанса() - 1
	Документ.Дата = Документ.Дата - 1;
	
	Попытка
	
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;

КонецФункции // ()

Функция ПринятьВРаботуОрганизации(Приниматель, ДанныеПринятия, Объекты)

	Документ = Приниматель.Создать(ДанныеПринятия);
	Документ.ДобавитьОбъекты(Объекты);
	
	Возврат Документ;

КонецФункции // ()

#КонецОбласти

Процедура ИзменитьЗапрос(СКД, ИмяСвойстваТекст)

	ТекстЗапроса = СКД.НаборыДанных.НаборДанныхЗапроса.Запрос;
	ИмяСвойства = СтрЗаменить(ИмяСвойстваТекст, " ", "");
	
	ТаблицаСвойства = "ДолговыеОбязательстваДополнительныеРеквизиты" + ИмяСвойства;
	
	НовыйТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"~ЗначениеСвойства~",
		", " + ТаблицаСвойства + ".Значение КАК " + ИмяСвойства + "~ЗначениеСвойства~");
		
	НовыйТекстЗапроса = СтрЗаменить(
		НовыйТекстЗапроса,
		"~СоединениеСвойства~",
		"	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДолговыеОбязательства.ДополнительныеРеквизиты КАК " + ТаблицаСвойства + "
		|		ПО ОбъектыВРаботеОстатки.Объект = " + ТаблицаСвойства + ".Ссылка
		|		И " + ТаблицаСвойства + ".Свойство.Наименование = """ + ИмяСвойстваТекст + """~СоединениеСвойства~");
		
	СКД.НаборыДанных.НаборДанныхЗапроса.Запрос = НовыйТекстЗапроса;

КонецПроцедуры

Процедура ОчиститьТегиВЗапросе(СКД)

	ТекстЗапроса = СКД.НаборыДанных.НаборДанныхЗапроса.Запрос;
	НовыйТекстЗапроса = СтрЗаменить(ТекстЗапроса, "~ЗначениеСвойства~", "");
	НовыйТекстЗапроса = СтрЗаменить(НовыйТекстЗапроса, "~СоединениеСвойства~", "");
	СКД.НаборыДанных.НаборДанныхЗапроса.Запрос = НовыйТекстЗапроса;

КонецПроцедуры

Процедура ОбработатьДополнительныеРеквизиты(СКД, ЭлементыОтбора);

	ДляУдаления = Новый Массив;
	
	Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
	
		Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
		
			ОбработатьДополнительныеРеквизиты(СКД, ЭлементОтбора.Элементы);
			Продолжить;
		
		КонецЕсли;
		
		Значение = Строка(ЭлементОтбора.ЛевоеЗначение);
		ПозицияДополнительногоСвойства = СтрНайти(Значение, "[");
		Если ПозицияДополнительногоСвойства = 0 Тогда
		
			Продолжить;
		
		КонецЕсли;
		
		ИмяСвойства = Сред(
			Значение,
			ПозицияДополнительногоСвойства + 1,
			СтрДлина(Значение) - ПозицияДополнительногоСвойства - 1);
	
		ЗаменитьЭлементДополнительногоСвойстваВОтборе(ЭлементыОтбора, ЭлементОтбора, ИмяСвойства);
		Если ЭлементОтбора.Использование Тогда
		
			ИзменитьЗапрос(СКД, ИмяСвойства);
		
		КонецЕсли;
		
		ДляУдаления.Добавить(ЭлементОтбора);
	
	КонецЦикла;
	ОчиститьТегиВЗапросе(СКД);
	Для каждого ЭлементУдаления Из ДляУдаления Цикл
	
		ЭлементыОтбора.Удалить(ЭлементУдаления);
	
	КонецЦикла;

КонецПроцедуры

Функция ОтборКорректен(Настройка)

	Если ТипЗнч(Настройка) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
	
		Возврат Истина;
	
	КонецЕсли;
	
	Значение = Строка(Настройка.ЛевоеЗначение);
	Состав = СтрРазделить(Значение, ".", Ложь);
	
	Если Состав.Количество() = 0 ИЛИ Состав[0] <> "Объект" Тогда
	
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Отбор для массовой печати делается по полю ОБЪЕКТ";
		Сообщение.Сообщить();
		Возврат Ложь;
	
	КонецЕсли;
	
	Возврат Истина;

КонецФункции // ()

Процедура ЗаменитьЭлементДополнительногоСвойстваВОтборе(ПриемникЭлементов, ЭлементОтбора, ИмяСвойстваТекст)

	//ГруппаДобавления = ЭлементОтбора.Родитель;
	//
	//НовыйОтбор = ГруппаДобавления.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Свойство");
	//НовыйОтбор.ПравоеЗначение = ИмяСвойства;
	//НовыйОтбор.Использование = ЭлементОтбора.Использование;

	//НовыйОтбор = ГруппаДобавления.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//НовыйОтбор.ВидСравнения = ЭлементОтбора.ВидСравнения;
	//НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Значение");
	//НовыйОтбор.ПравоеЗначение = ЭлементОтбора.ПравоеЗначение;
	//НовыйОтбор.Использование = ЭлементОтбора.Использование;
	
	ИмяСвойства = СтрЗаменить(ИмяСвойстваТекст, " ", "");
	
	ЭлементПриемник = ПриемникЭлементов.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементОтбора);
	ЭлементПриемник.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяСвойства);
	
КонецПроцедуры
